app/views/event_location/show.html.erb

<p>Max. seats: <%= h @location.available_seats %></p>
<p>Total Events: <%= @location.events.count %></p>
---
SELECT "events".* FROM "events" WHERE "events"."event_location_id" = ?  [["event_location_id", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."event_location_id" = ?  [["event_location_id", 1]]