app/controllers/event_location_controller.rb

SELECT "event_locations".* FROM "event_locations"  ORDER BY "event_locations"."name" ASC
---
  def index
    @locations = EventLocation.order(:name).all

SELECT  "event_locations".* FROM "event_locations" WHERE "event_locations"."id" = ? LIMIT 1  [["id", nil]]
---
  def show
    @location = EventLocation.find(params[:id])

INSERT INTO "event_locations" ("name", "available_seats", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Dortmund"], ["available_seats", 850], ["description", "Nice Nice"], ["created_at", "2016-03-24 11:17:33.110137"], ["updated_at", "2016-03-24 11:17:33.110137"]]
---
  def create
    @location = EventLocation.new(location_params)
    if @location.save

SELECT  "event_locations".* FROM "event_locations" WHERE "event_locations"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @location = EventLocation.find(params[:id])

SELECT  "event_locations".* FROM "event_locations" WHERE "event_locations"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "event_locations" SET "name" = ?, "available_seats" = ?, "updated_at" = ? WHERE "event_locations"."id" = ?  [["name", "Berlin"], ["available_seats", 50000], ["updated_at", "2016-04-01 13:29:37.656364"], ["id", 1]]
---
  def update
    @location = EventLocation.find(params[:id])
    if @location.update(location_params)

SELECT  "event_locations".* FROM "event_locations" WHERE "event_locations"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "event_locations" WHERE "event_locations"."id" = ?  [["id", 3]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]
---
  def destroy
    @location = EventLocation.find(params[:id])
    @location.destroy