app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("name", "description", "ticket_price", "event_location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "HelloParty"], ["description", "Hello"], ["ticket_price", 32.2], ["event_location_id", 1], ["created_at", "2016-04-04 13:32:18.726742"], ["updated_at", "2016-04-04 13:32:18.726742"]]

  def show
    @event = Event.find(params[:id])
    @total_ticket = @event.event_location.available_seats
    @ticket_sold = Order.where('event_id =?', @event.id).sum(:quantity)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "event_locations".* FROM "event_locations" WHERE "event_locations"."id" = ? LIMIT 1  [["id", 1]]
SELECT SUM("orders"."quantity") FROM "orders" WHERE (event_id =2)

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "ticket_price" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["ticket_price", 33.5], ["updated_at", "2016-04-04 13:32:50.675021"], ["id", 1]]