app/controllers/orders_controller.rb

SELECT  "event_locations".* FROM "event_locations" WHERE "event_locations"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT SUM("orders"."quantity") FROM "orders" WHERE (event_id =1)
INSERT INTO "orders" ("first_name", "last_name", "quantity", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Hans"], ["last_name", "Wurst"], ["quantity", 10], ["event_id", 1], ["created_at", "2016-04-04 13:33:04.808854"], ["updated_at", "2016-04-04 13:33:04.808854"]]
---
  def create
    @total_ticket = @event.event_location.available_seats
    @ticket_sold = Order.where('event_id =?', @event.id).sum(:quantity)
    @remaining_ticket = @total_ticket - @ticket_sold
    @order = Order.new(order_params)
    if @remaining_ticket >= params[:order][:quantity].to_i && @order.save